# MEPAnalyticalNode Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalNode Class
Members See Also
---
Represents an analytical node of the MEP analytical model.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public class MEPAnalyticalNode : IDisposable
```

Visual Basic
---
```text
Public Class MEPAnalyticalNode _
	Implements IDisposable
```

Visual C++
---
```text
public ref class MEPAnalyticalNode : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Analysis..::..MEPAnalyticalNode
# See Also
MEPAnalyticalNode Members
Autodesk.Revit.DB.Analysis Namespace